robotic-games/pocorobo-arduino/platform/boards.txt
# Pocorobo ESP32 Boards
# tools/make-boards-txt.py が arduino-esp32 3.3.11 の boards.txt(esp32s3) から生成する。手で編集しない。
menu.UploadSpeed=Upload Speed
menu.DebugLevel=Core Debug Level
menu.EraseFlash=Erase All Flash Before Sketch Upload

##############################################################

pocorobo_standard.name=Pocorobo Standard
pocorobo_standard.bootloader.tool=esptool_py
pocorobo_standard.bootloader.tool.default=esptool_py
pocorobo_standard.upload.tool=esptool_py
pocorobo_standard.upload.tool.default=esptool_py
pocorobo_standard.upload.tool.network=esp_ota
pocorobo_standard.upload.maximum_size=3145728
pocorobo_standard.upload.maximum_data_size=327680
pocorobo_standard.upload.flags=
pocorobo_standard.upload.erase_cmd=
pocorobo_standard.upload.extra_flags=
pocorobo_standard.upload.use_1200bps_touch=false
pocorobo_standard.upload.wait_for_upload_port=false
pocorobo_standard.serial.disableDTR=false
pocorobo_standard.serial.disableRTS=false
pocorobo_standard.build.tarch=xtensa
pocorobo_standard.build.bootloader_addr=0x0
pocorobo_standard.build.target=esp32s3
pocorobo_standard.build.mcu=esp32s3
pocorobo_standard.build.core=esp32
pocorobo_standard.build.variant=pocorobo_standard
pocorobo_standard.build.board=POCOROBO_STANDARD
pocorobo_standard.build.usb_mode=1
pocorobo_standard.build.cdc_on_boot=1
pocorobo_standard.build.msc_on_boot=0
pocorobo_standard.build.dfu_on_boot=0
pocorobo_standard.build.f_cpu=240000000L
pocorobo_standard.build.flash_size=8MB
pocorobo_standard.build.flash_freq=80m
pocorobo_standard.build.flash_mode=dio
pocorobo_standard.build.boot=qio
pocorobo_standard.build.boot_freq=80m
pocorobo_standard.build.partitions=pocorobo
pocorobo_standard.build.defines=
pocorobo_standard.build.loop_core=-DARDUINO_RUNNING_CORE=1
pocorobo_standard.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
pocorobo_standard.build.psram_type=qspi
pocorobo_standard.build.memory_type={build.boot}_{build.psram_type}
pocorobo_standard.build.copy_jtag_files=0
pocorobo_standard.build.zigbee_mode=
pocorobo_standard.build.zigbee_libs=

pocorobo_standard.menu.UploadSpeed.921600=921600
pocorobo_standard.menu.UploadSpeed.921600.upload.speed=921600
pocorobo_standard.menu.UploadSpeed.115200=115200
pocorobo_standard.menu.UploadSpeed.115200.upload.speed=115200
pocorobo_standard.menu.UploadSpeed.256000.windows=256000
pocorobo_standard.menu.UploadSpeed.256000.upload.speed=256000
pocorobo_standard.menu.UploadSpeed.230400.windows.upload.speed=256000
pocorobo_standard.menu.UploadSpeed.230400=230400
pocorobo_standard.menu.UploadSpeed.230400.upload.speed=230400
pocorobo_standard.menu.UploadSpeed.460800.linux=460800
pocorobo_standard.menu.UploadSpeed.460800.macosx=460800
pocorobo_standard.menu.UploadSpeed.460800.upload.speed=460800
pocorobo_standard.menu.UploadSpeed.512000.windows=512000
pocorobo_standard.menu.UploadSpeed.512000.upload.speed=512000

pocorobo_standard.menu.DebugLevel.none=None
pocorobo_standard.menu.DebugLevel.none.build.code_debug=0
pocorobo_standard.menu.DebugLevel.error=Error
pocorobo_standard.menu.DebugLevel.error.build.code_debug=1
pocorobo_standard.menu.DebugLevel.warn=Warn
pocorobo_standard.menu.DebugLevel.warn.build.code_debug=2
pocorobo_standard.menu.DebugLevel.info=Info
pocorobo_standard.menu.DebugLevel.info.build.code_debug=3
pocorobo_standard.menu.DebugLevel.debug=Debug
pocorobo_standard.menu.DebugLevel.debug.build.code_debug=4
pocorobo_standard.menu.DebugLevel.verbose=Verbose
pocorobo_standard.menu.DebugLevel.verbose.build.code_debug=5

pocorobo_standard.menu.EraseFlash.none=Disabled
pocorobo_standard.menu.EraseFlash.all=Enabled
pocorobo_standard.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

pocorobo_mini.name=Pocorobo Mini
pocorobo_mini.bootloader.tool=esptool_py
pocorobo_mini.bootloader.tool.default=esptool_py
pocorobo_mini.upload.tool=esptool_py
pocorobo_mini.upload.tool.default=esptool_py
pocorobo_mini.upload.tool.network=esp_ota
pocorobo_mini.upload.maximum_size=3145728
pocorobo_mini.upload.maximum_data_size=327680
pocorobo_mini.upload.flags=
pocorobo_mini.upload.erase_cmd=
pocorobo_mini.upload.extra_flags=
pocorobo_mini.upload.use_1200bps_touch=false
pocorobo_mini.upload.wait_for_upload_port=false
pocorobo_mini.serial.disableDTR=false
pocorobo_mini.serial.disableRTS=false
pocorobo_mini.build.tarch=xtensa
pocorobo_mini.build.bootloader_addr=0x0
pocorobo_mini.build.target=esp32s3
pocorobo_mini.build.mcu=esp32s3
pocorobo_mini.build.core=esp32
pocorobo_mini.build.variant=pocorobo_mini
pocorobo_mini.build.board=POCOROBO_MINI
pocorobo_mini.build.usb_mode=1
pocorobo_mini.build.cdc_on_boot=1
pocorobo_mini.build.msc_on_boot=0
pocorobo_mini.build.dfu_on_boot=0
pocorobo_mini.build.f_cpu=240000000L
pocorobo_mini.build.flash_size=8MB
pocorobo_mini.build.flash_freq=80m
pocorobo_mini.build.flash_mode=dio
pocorobo_mini.build.boot=qio
pocorobo_mini.build.boot_freq=80m
pocorobo_mini.build.partitions=pocorobo
pocorobo_mini.build.defines=
pocorobo_mini.build.loop_core=-DARDUINO_RUNNING_CORE=1
pocorobo_mini.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
pocorobo_mini.build.psram_type=qspi
pocorobo_mini.build.memory_type={build.boot}_{build.psram_type}
pocorobo_mini.build.copy_jtag_files=0
pocorobo_mini.build.zigbee_mode=
pocorobo_mini.build.zigbee_libs=

pocorobo_mini.menu.UploadSpeed.921600=921600
pocorobo_mini.menu.UploadSpeed.921600.upload.speed=921600
pocorobo_mini.menu.UploadSpeed.115200=115200
pocorobo_mini.menu.UploadSpeed.115200.upload.speed=115200
pocorobo_mini.menu.UploadSpeed.256000.windows=256000
pocorobo_mini.menu.UploadSpeed.256000.upload.speed=256000
pocorobo_mini.menu.UploadSpeed.230400.windows.upload.speed=256000
pocorobo_mini.menu.UploadSpeed.230400=230400
pocorobo_mini.menu.UploadSpeed.230400.upload.speed=230400
pocorobo_mini.menu.UploadSpeed.460800.linux=460800
pocorobo_mini.menu.UploadSpeed.460800.macosx=460800
pocorobo_mini.menu.UploadSpeed.460800.upload.speed=460800
pocorobo_mini.menu.UploadSpeed.512000.windows=512000
pocorobo_mini.menu.UploadSpeed.512000.upload.speed=512000

pocorobo_mini.menu.DebugLevel.none=None
pocorobo_mini.menu.DebugLevel.none.build.code_debug=0
pocorobo_mini.menu.DebugLevel.error=Error
pocorobo_mini.menu.DebugLevel.error.build.code_debug=1
pocorobo_mini.menu.DebugLevel.warn=Warn
pocorobo_mini.menu.DebugLevel.warn.build.code_debug=2
pocorobo_mini.menu.DebugLevel.info=Info
pocorobo_mini.menu.DebugLevel.info.build.code_debug=3
pocorobo_mini.menu.DebugLevel.debug=Debug
pocorobo_mini.menu.DebugLevel.debug.build.code_debug=4
pocorobo_mini.menu.DebugLevel.verbose=Verbose
pocorobo_mini.menu.DebugLevel.verbose.build.code_debug=5

pocorobo_mini.menu.EraseFlash.none=Disabled
pocorobo_mini.menu.EraseFlash.all=Enabled
pocorobo_mini.menu.EraseFlash.all.upload.erase_cmd=-e
